Data/Final_Implemented_data/Request/400 requests/wrr/test_wrr2.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   18.544 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      41036000 bytes
HTML transferred:       40960000 bytes
Requests per second:    21.57 [#/sec] (mean)
Time per request:       463.603 [ms] (mean)
Time per request:       46.360 [ms] (mean, across all concurrent requests)
Transfer rate:          2161.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       93  365 157.2    329     811
Processing:     1   92  86.2     78     414
Waiting:        0   90  86.1     77     413
Total:        119  457 188.6    421    1110

Percentage of the requests served within a certain time (ms)
  50%    421
  66%    516
  75%    594
  80%    633
  90%    726
  95%    813
  98%    874
  99%    980
 100%   1110 (longest request)